# Используем базовый образ с установленным Go
FROM golang:1.20.2

# Установка переменных окружения
ENV GO111MODULE=on \
    CGO_ENABLED=0 \
    GOOS=linux \
    GOARCH=amd64

# Создание директории приложения внутри контейнера
RUN mkdir /app

# Установка рабочей директории
WORKDIR /app

# Копирование файлов с зависимостями проекта
COPY go.mod .
COPY go.sum .

# Загрузка зависимостей
RUN go mod download

# Копирование исходного кода приложения
COPY . .

# Сборка бинарного файла
RUN go build -o main .

# Указываем команду, которая будет запущена при старте контейнера
CMD ["./main"]
